Revit 2026 API

# AdvancedTransparentSurfaceRotation Property

---

The property labeled "Rotation" from the "AdvancedTransparent" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SurfaceRotation { get; }
```
```vb
Public Shared ReadOnly Property SurfaceRotation As String
	Get
```
```cpp
public:
static property String^ SurfaceRotation {
	String^ get ();
}
```
```fsharp
static member SurfaceRotation : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace